Core/src/Documents/ТТНИсходящаяЕГАИС/ТТНИсходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТТНИсходящаяЕГАИС</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийТТНИсходящейЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиТТНИсходящейЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Упакована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенаправление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.СправкиБЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСправкиБПокупателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументовЕГАИС</name>
  <enumValues>
    <name>АктОтказаОтТТН</name>
  </enumValues>
  <enumValues>
    <name>АктПодтвержденияТТН</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВТорговомЗале</name>
  </enumValues>
  <enumValues>
    <name>АктРасхожденийТТН</name>
  </enumValues>
  <enumValues>
    <name>АктСписания</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзТорговогоЗала</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзТорговогоЗала</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатков</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВТорговомЗале</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиА</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиБ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОФорматеОбмена</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведения</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияФиксации</name>
  </enumValues>
  <enumValues>
    <name>ОтветАлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ОтветОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветОстатки</name>
  </enumValues>
  <enumValues>
    <name>ОтветОстаткиВТорговомЗале</name>
  </enumValues>
  <enumValues>
    <name>ОтказОтАктаРасхожденийТТН</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВТорговыйЗал</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеАктаРасхожденийТТН</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияСправокПоТТН</name>
  </enumValues>
  <enumValues>
    <name>СправкаА</name>
  </enumValues>
  <enumValues>
    <name>СправкаБ</name>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМ</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ТТНИсходящаяЕГАИС/Forms/ФормаСпискаУНФ/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ТТНИсходящаяЕГАИС.УстановитьУсловноеОформлениеСтатусаОбработки(ЭтотОбъект);
	//Паганини_
	ФункционалЗапретаРедактированияДокументов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалЗапретаРедактированияДокументов");
	//_Паганини
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокЗапросовЕГАИС" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьТТН(Команда)
	
	НачатьВыгрузкуДокумента(ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ТТН"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьАктРасхождений(Команда)
	
	НачатьВыгрузкуДокумента(ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ПодтверждениеАктаРасхожденийТТН"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяОтАктаРасхождений(Команда)
	
	НачатьВыгрузкуДокумента(ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ОтказОтАктаРасхожденийТТН"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьВыгрузкуДокумента(ВидДокумента)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ИнтеграцияЕГАИСКлиентСервер.ПараметрыИсходящегоЗапроса(ВидДокумента);
	ПараметрыЗапроса.ДокументСсылка = Элементы.Список.ТекущиеДанные.Ссылка;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ВыгрузкаДокумента_Завершение", ЭтотОбъект);
	ИнтеграцияЕГАИСКлиент.НачатьФормированиеИсходящегоЗапроса(
		ОповещениеПриЗавершении,
		ВидДокумента,
		ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаДокумента_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Результат Тогда
		Элементы.Список.Обновить();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='დოკუმენტი წარმატებით გადმოიტვირთა.';ru='Документ успешно выгружен.';en='Document successfully uploaded.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
